#include <iostream>
#include<string>
#include<cmath>
#include"Operate.h"
#include"SqStack.h"
using namespace std;
int main()
{
        while (1){
        char s[127];

        cout << "***************************************************************" << endl << endl;;
        cout << "*********************数据结构课程设计*************************" << endl;
        cout << "*********************算数表达式的计算*************************" << endl<<endl;
        cout << "***************************************************************" << endl;
        cout << "请输入表达式:(注意：表达式末尾以‘#’结束，除数不能为0)" << endl;
        cout << "----------------------------------" << endl;
        cin.getline(s, 127);
        
        //判断表达式末尾是否有‘#’
        if (s[strlen(s) - 1] != '#')
                cout << "表达式输入有误，请重新输入；" << endl;
        else{
                cout << "----------------------------------------------------------------------" << endl;
                cout << "该表达式的值为:" << endl;
                for (int i = 0;; i++){
                        if (s[i] == '#') break;
                        cout << s[i];
                }
               
                 cout << "=" << EvaluateExpression(s) << endl;
                 cout << "----------------------------------------------------------------------" << endl;
       }
        }
        return 0;
}